app/Controllers/Alumnos.php

    public function index()
    {
        // $alumnoModel = new AlumnoModel();

        $data['alumnos'] = $this->alumnoModel->findAll();
---
SELECT *
FROM `alumnos`

    public function renderEdit($id)
    {
        $data['alumno'] = $this->alumnoModel->find($id);
---
SELECT *
FROM `alumnos`
WHERE `alumnos`.`id` = '1'

    public function edit($id)
    {
        $data['alumno'] = $this->alumnoModel->find($id);
        $this->alumnoModel->update($id, $this->request->getPost());
---
UPDATE `alumnos` SET `nombre` = 'Jesús Gerardo ', `apellido` = 'Esquivel Ramírez', `telefono` = '7708-5832'
WHERE `alumnos`.`id` IN ('1')